<!-- azurenoops/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"0e3ff13c831224b4150ca41e661a3281f61f20a29b4de714605c640fb2fb58fe","plan_job_ref":"Job Create MPE Management terraform plan #84 at https://github.com/AFMPE/mpe_management/actions/runs/4846562996","plan_hash":"1f850420841a96cad2e0b3328b822ff30dbcccff823baaea60a9213a69b54127","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __src__
With backend config: `storage_account_name=afmpetfmgtprodh8dc4qua
container_name=core-mgt-prod-tfstate            
resource_group_name=afmpe-network-artifacts-rg
`
With var files: `src/tfvars/production/parameters.prod.tfvars
`<details open><summary>With variables</summary>

```hcl
state_sa_container_name           = (sensitive value)
state_sa_name                     = (sensitive value)
state_sa_rg                       = (sensitive value)
subscription_id_hub               = (sensitive value)
subscription_id_internal          = (sensitive value)
subscription_id_partners_gsa_dev  = (sensitive value)
subscription_id_partners_gsa_prod = (sensitive value)
subscription_id_sandbox           = (sensitive value)
```
</details>
<details>
<summary>Plan: 2 to add, 3 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.mod_sentinel_rule_alerts.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_alert_rule_scheduled.sentinel_alert["User_Added_To_Admin_365_Role"] will be created
  + resource "azurerm_sentinel_alert_rule_scheduled" "sentinel_alert" {
      + display_name               = "Add a User to an Admin Role (via office365)"
      + enabled                    = true
      + id                         = (known after apply)
      + log_analytics_workspace_id = "******************************************************************************************************************************************************************************************"
      + name                       = "User_Added_To_Admin_365_Role"
      + query                      = <<-EOT
            OfficeActivity 
            | where ((ModifiedProperties contains "admin") and (Operation == "Add member to role") and (ResultStatus == "Success"))
            | extend AccountCustomEntity = UserId
            | extend IPCustomEntity = ClientIP
        EOT
      + query_frequency            = "PT1H"
      + query_period               = "PT1H"
      + severity                   = "Medium"
      + suppression_duration       = "PT5H"
      + suppression_enabled        = false
      + tactics                    = [
          + "Persistence",
        ]
      + techniques                 = [
          + "T1078",
        ]
      + trigger_operator           = "GreaterThan"
      + trigger_threshold          = 0

      + entity_mapping {
          + entity_type = "Account"

          + field_mapping {
              + column_name = "FullName"
              + identifier  = "FullName"
            }
        }
      + entity_mapping {
          + entity_type = "IP"

          + field_mapping {
              + column_name = "IPCustomEntity"
              + identifier  = "Address"
            }
        }

      + event_grouping {
          + aggregation_method = "SingleAlert"
        }

      + incident_configuration {
          + create_incident = true

          + grouping {
              + enabled                 = false
              + entity_matching_method  = "AllEntities"
              + group_by_alert_details  = [
                  + "Severity",
                ]
              + group_by_entities       = []
              + lookback_duration       = "PT5H"
              + reopen_closed_incidents = false
            }
        }
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_alert_rule_scheduled.sentinel_alert["User_Added_To_Local_Admins"] will be updated in-place
  ~ resource "azurerm_sentinel_alert_rule_scheduled" "sentinel_alert" {
        id                         = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/resourceGroups/ampe-eus-ops-logging-core-prod-rg/providers/Microsoft.OperationalInsights/workspaces/ampe-eus-ops-logging-core-prod-log/providers/Microsoft.SecurityInsights/alertRules/User_Added_To_Local_Admins"
        name                       = "User_Added_To_Local_Admins"
        # (14 unchanged attributes hidden)

      ~ entity_mapping {
            # (1 unchanged attribute hidden)

          ~ field_mapping {
              ~ column_name = "DeviceName" -> "HostName"
                # (1 unchanged attribute hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.mod_sentinel_rule_alerts.azurerm_sentinel_data_connector_microsoft_threat_intelligence.dataMTI must be replaced
-/+ resource "azurerm_sentinel_data_connector_microsoft_threat_intelligence" "dataMTI" {
      + bing_safety_phishing_url_lookback_date       = "1970-01-01T00:00:00Z" # forces replacement
      ~ id                                           = "*************************************************************************************************************************************************************************************************************************************************************" -> (known after apply)
        name                                         = "MSTI_Connector"
      ~ tenant_id                                    = "************************************" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["StorageAccounts"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/StorageAccounts"
      - subplan       = "PerTransaction" -> null
        # (2 unchanged attributes hidden)
    }

  # module.landing_zone.module.mod_operational_logging.azurerm_security_center_subscription_pricing.main["VirtualMachines"] will be updated in-place
  ~ resource "azurerm_security_center_subscription_pricing" "main" {
        id            = "/subscriptions/7eb60145-02f2-4fc1-80d2-e25d2ce9e45d/providers/Microsoft.Security/pricings/VirtualMachines"
      - subplan       = "P2" -> null
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Create MPE Management terraform plan #84](https://github.com/AFMPE/mpe_management/actions/runs/4846562996)